src/cf/Reports/уатВсеОВагоне.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>уатВсеОВагоне</Name>
		</Properties>
	</Report>
</MetaDataObject>

src/cf/InformationRegisters/уатОбеспечениеЗаказовНаТСВагонами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатОбеспечениеЗаказовНаТСВагонами</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоУпаковок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказНаТС</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерГУ12</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Груз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатГрузовыеМеста_уэ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодГруза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКодыЕТСНГ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вагон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/уатНатурныйЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатНатурныйЛист</Name>
			<BasedOn>
				<xr:Item>Document.уатЗаказГрузоотправителя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГоловаХвост</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПрибытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Живность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексНегабаритности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПрикрытия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассаБрутто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПоезда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСостава</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение организации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтанцияНазначения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтанцияОтправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловнаяДлина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Вагоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерВагона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСобственника</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МассаГруза</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтанцияНазначенияВагона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодГруза</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатКодыЕТСНГ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодПолучателя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсобыеОтметки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЗПУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоКонтейнеров</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыходнаяПограничнаяСтанция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТараВагона</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Больной</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Фронт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатГрузовыеФронты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разметка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяПровеска</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Reports/уатВсеОВагоне/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область ОбработчикиКомандФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПериодДатаНач = НачалоМесяца(ТекущаяДатаСеанса());
	ПериодДатаКон = КонецМесяца(ТекущаяДатаСеанса());
	
	Элементы.Станция.Доступность = ПоСтанции;
	Элементы.ГруппаОтборы2.Видимость = ПоСтанции;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПериода(Команда)
	ДиалогПериода = Новый ДиалогРедактированияСтандартногоПериода();
	ДиалогПериода.Период.ДатаНачала = ПериодДатаНач;
	ДиалогПериода.Период.ДатаОкончания = ПериодДатаКон;
	ДиалогПериода.Показать(Новый ОписаниеОповещения("НастройкаПериодаЗавершение", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПериодаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ПериодДатаНач = Результат.ДатаНачала;
		ПериодДатаКон = Результат.ДатаОкончания;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	Если НЕ ЗначениеЗаполнено(Вагон) Тогда
		ТекстНСТР = НСтр("en='';ru='Не указан вагон'");
		ПоказатьПредупреждение(, ТекстНСТР, 10);
		Возврат;
	КонецЕсли;
	
	Если ПоСтанции И НЕ ЗначениеЗаполнено(Станция) Тогда
		ТекстНСТР = НСтр("en='';ru='Не указана станция'");
		ПоказатьПредупреждение(, ТекстНСТР, 10);
		Возврат;
	КонецЕсли;
	
	Если Не ПоСтанции Тогда
		ЗаказНаТСПрибытие = Неопределено;
		ЗаказНаТСУбытие = Неопределено;
	КонецЕсли;
	
	ТабДок = СформироватьОтчет();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоСтанцииПриИзменении(Элемент)
	Элементы.Станция.Доступность = ПоСтанции;
	Элементы.ГруппаОтборы2.Видимость = ПоСтанции;
КонецПроцедуры

&НаКлиенте
Процедура ВагонНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОписаниеОповещения = Новый ОписаниеОповещения("ВагонНачалоВыбораЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.уатТС.ФормаВыбора", Новый Структура("ЖД", Истина), ЭтотОбъект,,,, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВагонНачалоВыбораЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Вагон = Результат;
	
КонецПроцедуры

&НаКлиенте
Процедура СтанцияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОписаниеОповещения = Новый ОписаниеОповещения("СтанцияНачалоВыбораЗавершение", ЭтотОбъект);
	ОтборПоТипуПункта = Новый Структура("ТипПункта", ПредопределенноеЗначение("Справочник.уатТипыПунктов.ЖДстанция"));
	ОткрытьФорму("Справочник.уатПунктыНазначения.ФормаВыбора", Новый Структура("Отбор", ОтборПоТипуПункта), ЭтотОбъект,,,,
		ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура СтанцияПриИзменении(Элемент)
	
	ЗаказНаТСПрибытие = Неопределено;
	ЗаказНаТСУбытие = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура СтанцияНачалоВыбораЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Станция = Результат;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказНаТСПрибытиеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Вагон) Или Не ЗначениеЗаполнено(Станция) 
		Или Не ЗначениеЗаполнено(ПериодДатаНач) Или Не ЗначениеЗаполнено(ПериодДатаКон )Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Для выбора Заказа на ТС заполните отборы из первой строки'"));
		Возврат;
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ОтборПоПрибытиюУбытию", Истина);
	СтруктураПараметров.Вставить("ЭтоПрибытие", Истина);
	СтруктураПараметров.Вставить("Вагон", Вагон);
	СтруктураПараметров.Вставить("Станция", Станция);
	СтруктураПараметров.Вставить("ДатаНачала", ПериодДатаНач);
	СтруктураПараметров.Вставить("ДатаОкончания", ПериодДатаКон);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаказНаТСНачалоВыбораЗавершение", ЭтотОбъект, СтруктураПараметров);
	ОткрытьФорму("Документ.уатЗаказГрузоотправителя.ФормаВыбора", СтруктураПараметров, ЭтотОбъект,,,,ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ЗаказНаТСУбытиеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Вагон) Или Не ЗначениеЗаполнено(Станция) 
		Или Не ЗначениеЗаполнено(ПериодДатаНач) Или Не ЗначениеЗаполнено(ПериодДатаКон )Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Для выбора Заказа на ТС заполните отборы из первой строки'"));
		Возврат;
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ОтборПоПрибытиюУбытию", Истина);
	СтруктураПараметров.Вставить("ЭтоПрибытие", Ложь);
	СтруктураПараметров.Вставить("Вагон", Вагон);
	СтруктураПараметров.Вставить("Станция", Станция);
	СтруктураПараметров.Вставить("ДатаНачала", ПериодДатаНач);
	СтруктураПараметров.Вставить("ДатаОкончания", ПериодДатаКон);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаказНаТСНачалоВыбораЗавершение", ЭтотОбъект, СтруктураПараметров);
	ОткрытьФорму("Документ.уатЗаказГрузоотправителя.ФормаВыбора", СтруктураПараметров, ЭтотОбъект,,,,ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ЗаказНаТСНачалоВыбораЗавершение(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДопПараметры.ЭтоПрибытие Тогда
		ЗаказНаТСПрибытие = Результат;
	Иначе
		ЗаказНаТСУбытие   = Результат;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодобратьЗаказыНаТС(Команда)
	
	ПодобратьЗаказыНаТСНаСервере(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СформироватьОтчет()
	
	ПодобратьЗаказыНаТСНаСервере();
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	НатурныйЛистПрибытие = Неопределено;
	НатурныйЛистУбытие   = Неопределено;
	ОперацияПрибытие     = Неопределено;
	ОперацияУбытие       = Неопределено;
	ПровескаПрибытие     = Неопределено;
	ПровескаУбытие       = Неопределено;
	
	Запрос = Новый Запрос;
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	
	Если ПоСтанции Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	уатНатурныйЛистВагоны.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_НатурныйЛистПрибытие
		|ИЗ
		|	Документ.уатНатурныйЛист.Вагоны КАК уатНатурныйЛистВагоны
		|ГДЕ
		|	уатНатурныйЛистВагоны.Ссылка.СтанцияНазначения = &Станция
		|	И уатНатурныйЛистВагоны.Ссылка.Проведен
		|	И уатНатурныйЛистВагоны.НомерВагона = &Вагон
		|	И уатНатурныйЛистВагоны.Ссылка.ДатаОтправления > &ДатаОтправления
		|	И уатНатурныйЛистВагоны.Ссылка.ДатаПрибытия <= &ДатаПрибытия
		|
		|УПОРЯДОЧИТЬ ПО
		|	уатНатурныйЛистВагоны.Ссылка.МоментВремени УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	уатНатурныйЛистВагоны.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_НатурныйЛистУбытие
		|ИЗ
		|	Документ.уатНатурныйЛист.Вагоны КАК уатНатурныйЛистВагоны
		|ГДЕ
		|	уатНатурныйЛистВагоны.Ссылка.СтанцияОтправления = &Станция
		|	И уатНатурныйЛистВагоны.Ссылка.Проведен
		|	И уатНатурныйЛистВагоны.НомерВагона = &Вагон
		|	И уатНатурныйЛистВагоны.Ссылка.ДатаОтправления > &ДатаОтправления
		|	И уатНатурныйЛистВагоны.Ссылка.ДатаПрибытия <= &ДатаПрибытия
		|
		|УПОРЯДОЧИТЬ ПО
		|	уатНатурныйЛистВагоны.Ссылка.МоментВремени УБЫВ";
		Запрос.УстановитьПараметр("Станция", Станция);
		Запрос.УстановитьПараметр("Вагон", Вагон);
		Запрос.УстановитьПараметр("ДатаОтправления", ПериодДатаНач);
		Запрос.УстановитьПараметр("ДатаПрибытия", ПериодДатаКон);
		
		РезультатыЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
		
		ВыборкаПрибытие = РезультатыЗапроса[0].Выбрать();
		НатурныйЛистПрибытие = ?(ВыборкаПрибытие.Следующий(), ВыборкаПрибытие.Ссылка, Неопределено);
		
		ВыборкаУбытие = РезультатыЗапроса[1].Выбрать();
		НатурныйЛистУбытие = ?(ВыборкаУбытие.Следующий(), ВыборкаУбытие.Ссылка, Неопределено);
		
	Иначе
		
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	уатНатурныйЛистВагоны.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_НатурныйЛистПрибытие
		|ИЗ
		|	Документ.уатНатурныйЛист.Вагоны КАК уатНатурныйЛистВагоны
		|ГДЕ
		|	уатНатурныйЛистВагоны.Ссылка.Проведен
		|	И уатНатурныйЛистВагоны.НомерВагона = &Вагон
		|	И уатНатурныйЛистВагоны.Ссылка.ДатаОтправления > &ДатаОтправления
		|
		|УПОРЯДОЧИТЬ ПО
		|	уатНатурныйЛистВагоны.Ссылка.МоментВремени УБЫВ";
		Запрос.УстановитьПараметр("Вагон", Вагон);
		Запрос.УстановитьПараметр("ДатаОтправления", ПериодДатаНач);
		
		РезультатыЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
		
		ВыборкаПрибытие = РезультатыЗапроса[0].Выбрать();
		НатурныйЛистПрибытие = ?(ВыборкаПрибытие.Следующий(), ВыборкаПрибытие.Ссылка, Неопределено);
		
	КонецЕсли;
	
	Если Не (ЗначениеЗаполнено(НатурныйЛистПрибытие) Или ЗначениеЗаполнено(НатурныйЛистУбытие)) Тогда
		ТекстНСтр = НСтр("ru='В указанный период не найдены Натурные листы связанные с вагоном ""%1""'");
		Если ПоСтанции Тогда
			ТекстНСтр = ТекстНСтр + НСтр("ru=' и станцией ""%2""'");
			ТекстНСтр = СтрЗаменить(ТекстНСтр, "%2", Станция);
		КонецЕсли;
		ТекстНСтр = СтрЗаменить(ТекстНСтр, "%1", Вагон);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСтр);
		Возврат 1;
	КонецЕсли;
	
	НатурныйЛистПрибытие = ?(ЗначениеЗаполнено(НатурныйЛистПрибытие), НатурныйЛистПрибытие, Документы.уатНатурныйЛист.ПустаяСсылка());
	НатурныйЛистУбытие = ?(ЗначениеЗаполнено(НатурныйЛистУбытие), НатурныйЛистУбытие, Документы.уатНатурныйЛист.ПустаяСсылка());
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 100
	|	уатОперацияСВагонамиВагоны.Ссылка КАК Ссылка,
	|	уатОперацияСВагонамиВагоны.Ссылка.Операция КАК Операция,
	|	уатОперацияСВагонамиВагоны.ДатаОперации КАК Дата,
	|	уатОперацияСВагонамиВагоны.Ссылка.Номер КАК Номер,
	|	1 КАК Прибытие
	|ПОМЕСТИТЬ ВТ_ОперацияПрибытиеУбытие
	|ИЗ
	|	Документ.уатОперацияСВагонами.Вагоны КАК уатОперацияСВагонамиВагоны
	|ГДЕ
	|	уатОперацияСВагонамиВагоны.ЗаказНаТС = &ЗаказНаТСПрибытие
	|	И уатОперацияСВагонамиВагоны.Ссылка.НатурныйЛист = &НатурныйЛистПрибытие
	|	И уатОперацияСВагонамиВагоны.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 100
	|	уатОперацияСВагонамиВагоны.Ссылка,
	|	уатОперацияСВагонамиВагоны.Ссылка.Операция,
	|	уатОперацияСВагонамиВагоны.ДатаОперации,
	|	уатОперацияСВагонамиВагоны.Ссылка.Номер,
	|	0
	|ИЗ
	|	Документ.уатОперацияСВагонами.Вагоны КАК уатОперацияСВагонамиВагоны
	|ГДЕ
	|	уатОперацияСВагонамиВагоны.ЗаказНаТС = &ЗаказНаТСУбытие
	|	И уатОперацияСВагонамиВагоны.Ссылка.НатурныйЛист = &НатурныйЛистУбытие
	|	И уатОперацияСВагонамиВагоны.Ссылка.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	уатПровескаВагоны.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ПровескаПрибытие
	|ИЗ
	|	Документ.уатПровеска КАК уатПровеска
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уатПровеска.Вагоны КАК уатПровескаВагоны
	|		ПО (уатПровескаВагоны.Ссылка = уатПровеска.Ссылка)
	|ГДЕ
	|	уатПровескаВагоны.Заказ = &ЗаказНаТСПрибытие
	|	И уатПровеска.НатурныйЛист = &НатурныйЛистПрибытие
	|	И уатПровеска.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	уатПровескаВагоны.Ссылка.МоментВремени УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	уатПровескаВагоны.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ПровескаУбытие
	|ИЗ
	|	Документ.уатПровеска КАК уатПровеска
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уатПровеска.Вагоны КАК уатПровескаВагоны
	|		ПО (уатПровескаВагоны.Ссылка = уатПровеска.Ссылка)
	|ГДЕ
	|	уатПровескаВагоны.Заказ = &ЗаказНаТСУбытие
	|	И уатПровеска.НатурныйЛист = &НатурныйЛистУбытие
	|	И уатПровеска.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	уатПровескаВагоны.Ссылка.МоментВремени УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	уатПровескаВагоны.Груз КАК Груз,
	|	уатПровескаВагоны.КодГруза КАК КодГруза,
	|	уатПровескаВагоны.Брутто КАК Брутто,
	|	уатПровескаВагоны.Тара КАК Тара,
	|	уатПровескаВагоны.НеттоРасчетное КАК НеттоРасчетное,
	|	уатПровескаВагоны.Нетто КАК Нетто,
	|	1 КАК Прибытие
	|ПОМЕСТИТЬ ВТ_ПровескаПрибытиеУбытиеГрузы
	|ИЗ
	|	Документ.уатПровеска.Вагоны КАК уатПровескаВагоны
	|ГДЕ
	|	уатПровескаВагоны.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_ПровескаПрибытие.Ссылка КАК Ссылка
	|			ИЗ
	|				ВТ_ПровескаПрибытие КАК ВТ_ПровескаПрибытие)
	|	И уатПровескаВагоны.Вагон = &Вагон
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	уатПровескаВагоны.Груз,
	|	уатПровескаВагоны.КодГруза,
	|	уатПровескаВагоны.Брутто,
	|	уатПровескаВагоны.Тара,
	|	уатПровескаВагоны.НеттоРасчетное,
	|	уатПровескаВагоны.Нетто,
	|	0
	|ИЗ
	|	Документ.уатПровеска.Вагоны КАК уатПровескаВагоны
	|ГДЕ
	|	уатПровескаВагоны.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_ПровескаУбытие.Ссылка КАК Ссылка
	|			ИЗ
	|				ВТ_ПровескаУбытие КАК ВТ_ПровескаУбытие)
	|	И уатПровескаВагоны.Вагон = &Вагон";
	Запрос.УстановитьПараметр("ЗаказНаТСПрибытие",ЗаказНаТСПрибытие);
	Запрос.УстановитьПараметр("НатурныйЛистПрибытие", НатурныйЛистПрибытие);
	Запрос.УстановитьПараметр("ЗаказНаТСУбытие", ЗаказНаТСУбытие);
	Запрос.УстановитьПараметр("НатурныйЛистУбытие", НатурныйЛистУбытие);
	Запрос.УстановитьПараметр("Вагон", Вагон);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ВыгрузкаОперацииПрибытиеУбытие = РезультатыЗапроса[0].Выгрузить();
	
	ВыборкаПрибытие = РезультатыЗапроса[1].Выбрать();
	ПровескаПрибытие = ?(ВыборкаПрибытие.Следующий(), ВыборкаПрибытие.Ссылка, Неопределено);
	
	ВыборкаУбытие = РезультатыЗапроса[2].Выбрать();
	ПровескаУбытие = ?(ВыборкаУбытие.Следующий(), ВыборкаУбытие.Ссылка, Неопределено);
	
	ВыгрузкаПровескаГрузы = РезультатыЗапроса[3].Выгрузить();
	
	ТаблицаПровесокДляПечати = СформироватьТаблицуПровесокДляПечати(ВыгрузкаПровескаГрузы);
	ТаблицаОперацийДляПечати = СформироватьТаблицуОперацийДляПечати(ВыгрузкаОперацииПрибытиеУбытие);
	
	ОперацияПрибытие = Неопределено;
	ОперацияУбытие   = Неопределено;
	
	Макет = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("Макет");
	
	Шапка = Макет.ПолучитьОбласть("Заголовок");
	Шапка.Параметры.НомерВагона = Вагон;
	Шапка.Параметры.ДатаС = Формат(ПериодДатаНач, "ДФ=dd.MM.yyyy");
	Шапка.Параметры.ДатаПо = Формат(ПериодДатаКон, "ДФ=dd.MM.yyyy");
	
	ДокументРезультат.Вывести(Шапка);
	
	ИнформацияОВагоне = Макет.ПолучитьОбласть("ИнформацияОВагоне");
	ИнформацияОВагоне.Параметры.Модель = Вагон.Модель;
	ИнформацияОВагоне.Параметры.ТипВагона = Вагон.ТипТС;
	ИнформацияОВагоне.Параметры.Род = Вагон.ТипТС.РодВагона;
	ИнформацияОВагоне.Параметры.Тара = Вагон.СобственныйВес;
	ИнформацияОВагоне.Параметры.Грузоподъемность = Вагон.Грузоподъемность;
	ИнформацияОВагоне.Параметры.Объем = Вагон.ОбъемКузова;
	ДокументРезультат.Вывести(ИнформацияОВагоне);
	
	Если ПоСтанции Тогда
		
		ДатаПрибытия = Дата("00010101");
		ДатаУбытия = Дата("00010101");
		
		НайтиОперацииРегистрирующиеПрибытиеУбытие(ОперацияПрибытие, ДатаПрибытия, ОперацияУбытие, ДатаУбытия, ВыгрузкаОперацииПрибытиеУбытие);
		
		ЗаголовокСтанция = Макет.ПолучитьОбласть("ЗаголовокСтанция");
		ЗаголовокСтанция.Параметры.Станция = Станция;
		ДокументРезультат.Вывести(ЗаголовокСтанция);
		
		ЗаголовокЗаказНаТС = Макет.ПолучитьОбласть("ЗаголовокЗаказНаТС");
		ДокументРезультат.Вывести(ЗаголовокЗаказНаТС);
		
		ПрибытиеУбытиеЗаказНаТС = Макет.ПолучитьОбласть("ПрибытиеУбытиеЗаказНаТС");
		ПрибытиеУбытиеЗаказНаТС.Параметры.ЗаказНаТСПрибытие = ЗаказНаТСПрибытие.Номер;
		ПрибытиеУбытиеЗаказНаТС.Параметры.ЗаказНаТСУбытие   = ЗаказНаТСУбытие.Номер;
		ПрибытиеУбытиеЗаказНаТС.Параметры.ЗаказНаТСУбытиеСсылка   = ЗаказНаТСУбытие;
		ПрибытиеУбытиеЗаказНаТС.Параметры.ЗаказНаТСПрибытиеСсылка = ЗаказНаТСПрибытие;
		ДокументРезультат.Вывести(ПрибытиеУбытиеЗаказНаТС);
		
		ЗаголовокНатурныйЛист = Макет.ПолучитьОбласть("ЗаголовокНатурныйЛист");
		ДокументРезультат.Вывести(ЗаголовокНатурныйЛист);
		
		ПрибытиеУбытиеНатурныйЛист = Макет.ПолучитьОбласть("ПрибытиеУбытиеНатурныйЛист");
		ПрибытиеУбытиеНатурныйЛист.Параметры.НатурныйЛистПрибытие = НатурныйЛистПрибытие.Номер;
		ПрибытиеУбытиеНатурныйЛист.Параметры.НатурныйЛистУбытие   = НатурныйЛистУбытие.Номер;
		ПрибытиеУбытиеНатурныйЛист.Параметры.НатурныйЛистПрибытиеСсылка = НатурныйЛистПрибытие;
		ПрибытиеУбытиеНатурныйЛист.Параметры.НатурныйЛистУбытиеСсылка   = НатурныйЛистУбытие;
		ДокументРезультат.Вывести(ПрибытиеУбытиеНатурныйЛист);
		
		ЗаголовокОперация = Макет.ПолучитьОбласть("ЗаголовокОперация");
		ДокументРезультат.Вывести(ЗаголовокОперация);
		ПрибытиеУбытиеОперацияСтрокаЗаголовок = Макет.ПолучитьОбласть("ПрибытиеУбытиеОперацияСтрокаЗаголовок");
		ДокументРезультат.Вывести(ПрибытиеУбытиеОперацияСтрокаЗаголовок);
		
		Для каждого ТекСтрока Из ТаблицаОперацийДляПечати Цикл
			ПрибытиеУбытиеОперацияСтрока = Макет.ПолучитьОбласть("ПрибытиеУбытиеОперацияСтрока");
			ПрибытиеУбытиеОперацияСтрока.Параметры.ОперацияПрибытиеСсылка  = ТекСтрока.ОперацияПрибытиеСсылка;
			ПрибытиеУбытиеОперацияСтрока.Параметры.ОперацияПрибытиеДата    = ТекСтрока.ОперацияПрибытиеДата;
			ПрибытиеУбытиеОперацияСтрока.Параметры.ОперацияПрибытиеВид     = ТекСтрока.ОперацияПрибытиеВид;
			ПрибытиеУбытиеОперацияСтрока.Параметры.ОперацияПрибытиеНомер   = ТекСтрока.ОперацияПрибытиеНомер;
			
			ПрибытиеУбытиеОперацияСтрока.Параметры.ОперацияУбытиеСсылка  = ТекСтрока.ОперацияУбытиеСсылка;
			ПрибытиеУбытиеОперацияСтрока.Параметры.ОперацияУбытиеДата    = ТекСтрока.ОперацияУбытиеДата;
			ПрибытиеУбытиеОперацияСтрока.Параметры.ОперацияУбытиеВид     = ТекСтрока.ОперацияУбытиеВид;
			ПрибытиеУбытиеОперацияСтрока.Параметры.ОперацияУбытиеНомер   = ТекСтрока.ОперацияУбытиеНомер;
			
			Если Не ТекСтрока.ЗаполненоПрибытие Тогда
				ОбластьПрибытия = ПрибытиеУбытиеОперацияСтрока.Области.ОбластьОперацияПрибытие;
				ОбластьПрибытия.Очистить(Ложь, Ложь, Истина);
			КонецЕсли;
			
			Если Не ТекСтрока.ЗаполненоУбытие Тогда
				ОбластьУбытия = ПрибытиеУбытиеОперацияСтрока.Области.ОбластьОперацияУбытие;
				ОбластьУбытия.Очистить(Ложь, Ложь, Истина);
			КонецЕсли;
			
			ДокументРезультат.Вывести(ПрибытиеУбытиеОперацияСтрока);
		КонецЦикла;
		
		ЗаголовокПровеска = Макет.ПолучитьОбласть("ЗаголовокПровеска");
		Если ЗначениеЗаполнено(ПровескаПрибытие) Тогда
			ЗаголовокПровеска.Параметры.ПровескаПрибытие = ПровескаПрибытие.Номер;
			ЗаголовокПровеска.Параметры.ПровескаПрибытиеСсылка = ПровескаПрибытие;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПровескаУбытие) Тогда
			ЗаголовокПровеска.Параметры.ПровескаУбытие   = ПровескаУбытие.Номер;
			ЗаголовокПровеска.Параметры.ПровескаУбытиеСсылка   = ПровескаУбытие;
		КонецЕсли;
		ДокументРезультат.Вывести(ЗаголовокПровеска);
		
		ПрибытиеУбытиеПровескаЗаголовок = Макет.ПолучитьОбласть("ПрибытиеУбытиеПровескаЗаголовок");
		ДокументРезультат.Вывести(ПрибытиеУбытиеПровескаЗаголовок);
		
		Для каждого ТекПровеска Из ТаблицаПровесокДляПечати Цикл
			
			ПрибытиеУбытиеПровескаСтрока = Макет.ПолучитьОбласть("ПрибытиеУбытиеПровескаСтрока");
			ПрибытиеУбытиеПровескаСтрока.Параметры.КодГрузаПрибытие       = ТекПровеска.КодГрузаПрибытие;
			ПрибытиеУбытиеПровескаСтрока.Параметры.ГрузПрибытие           = ТекПровеска.ГрузПрибытие;
			ПрибытиеУбытиеПровескаСтрока.Параметры.БруттоПеревесПрибытие  = ТекПровеска.БруттоПрибытие;
			ПрибытиеУбытиеПровескаСтрока.Параметры.ТараДокПрибытие        = ТекПровеска.ТараПрибытие;
			ПрибытиеУбытиеПровескаСтрока.Параметры.НеттоРасчетноеПрибытие = ТекПровеска.НеттоРасчетноеПрибытие;
			ПрибытиеУбытиеПровескаСтрока.Параметры.НеттоДокПрибытие       = ТекПровеска.НеттоПрибытие;
			
			НеттоРасчетноеПрибытие = ?(ЗначениеЗаполнено(ТекПровеска.НеттоРасчетноеПрибытие), ТекПровеска.НеттоРасчетноеПрибытие, 0);
			НеттоПрибытие          = ?(ЗначениеЗаполнено(ТекПровеска.НеттоПрибытие), ТекПровеска.НеттоПрибытие, 0);
			
			ПрибытиеУбытиеПровескаСтрока.Параметры.РазницаПрибытие        = НеттоРасчетноеПрибытие - НеттоПрибытие;
			
			ПрибытиеУбытиеПровескаСтрока.Параметры.КодГрузаУбытие       = ТекПровеска.КодГрузаУбытие;
			ПрибытиеУбытиеПровескаСтрока.Параметры.ГрузУбытие           = ТекПровеска.ГрузУбытие;
			ПрибытиеУбытиеПровескаСтрока.Параметры.БруттоПеревесУбытие  = ТекПровеска.БруттоУбытие;
			ПрибытиеУбытиеПровескаСтрока.Параметры.ТараДокУбытие        = ТекПровеска.ТараУбытие;
			ПрибытиеУбытиеПровескаСтрока.Параметры.НеттоРасчетноеУбытие = ТекПровеска.НеттоРасчетноеУбытие;
			ПрибытиеУбытиеПровескаСтрока.Параметры.НеттоДокУбытие       = ТекПровеска.НеттоУбытие;
			
			НеттоРасчетноеУбытие = ?(ЗначениеЗаполнено(ТекПровеска.НеттоРасчетноеУбытие), ТекПровеска.НеттоРасчетноеУбытие, 0);
			НеттоУбытие          = ?(ЗначениеЗаполнено(ТекПровеска.НеттоУбытие), ТекПровеска.НеттоУбытие, 0);
			
			ПрибытиеУбытиеПровескаСтрока.Параметры.РазницаУбытие        = НеттоРасчетноеУбытие - НеттоУбытие;
			
			Если Не ТекПровеска.ЗаполненоПрибытие Тогда
				ОбластьПрибытия = ПрибытиеУбытиеПровескаСтрока.Области.ОбластьПровескаПрибытие;
				ОбластьПрибытия.Очистить(Ложь, Ложь, Истина);
			КонецЕсли;
			
			Если Не ТекПровеска.ЗаполненоУбытие Тогда
				ОбластьУбытия = ПрибытиеУбытиеПровескаСтрока.Области.ОбластьПровескаУбытие;
				ОбластьУбытия.Очистить(Ложь, Ложь, Истина);
			КонецЕсли;
			
			ДокументРезультат.Вывести(ПрибытиеУбытиеПровескаСтрока);
			
		КонецЦикла;
		
	Иначе
		
		ЗаголовокЗаказНаТСБезСтанции = Макет.ПолучитьОбласть("ЗаголовокЗаказНаТСБезСтанции");
		ДокументРезультат.Вывести(ЗаголовокЗаказНаТСБезСтанции);
		
		ПрибытиеУбытиеЗаказНаТСБезСтанции = Макет.ПолучитьОбласть("ПрибытиеУбытиеЗаказНаТСБезСтанции");
		ПрибытиеУбытиеЗаказНаТСБезСтанции.Параметры.ЗаказНаТСПрибытие = ЗаказНаТСПрибытие.Номер;
		ПрибытиеУбытиеЗаказНаТСБезСтанции.Параметры.ЗаказНаТСПрибытиеСсылка = ЗаказНаТСПрибытие;
		ДокументРезультат.Вывести(ПрибытиеУбытиеЗаказНаТСБезСтанции);
		
		ЗаголовокНатурныйЛистБезСтанции = Макет.ПолучитьОбласть("ЗаголовокНатурныйЛистБезСтанции");
		ДокументРезультат.Вывести(ЗаголовокНатурныйЛистБезСтанции);
		
		ПрибытиеУбытиеНатурныйЛистБезСтанции = Макет.ПолучитьОбласть("ПрибытиеУбытиеНатурныйЛистБезСтанции");
		ПрибытиеУбытиеНатурныйЛистБезСтанции.Параметры.НатурныйЛистПрибытие = НатурныйЛистПрибытие.Номер;
		ПрибытиеУбытиеНатурныйЛистБезСтанции.Параметры.НатурныйЛистПрибытиеСсылка = НатурныйЛистПрибытие;
		ДокументРезультат.Вывести(ПрибытиеУбытиеНатурныйЛистБезСтанции);
		
		ЗаголовокОперацияБезСтанции = Макет.ПолучитьОбласть("ЗаголовокОперацияБезСтанции");
		ДокументРезультат.Вывести(ЗаголовокОперацияБезСтанции);
		ПрибытиеУбытиеОперацияСтрокаЗаголовокБезСтанции = Макет.ПолучитьОбласть("ПрибытиеУбытиеОперацияСтрокаЗаголовокБезСтанции");
		ДокументРезультат.Вывести(ПрибытиеУбытиеОперацияСтрокаЗаголовокБезСтанции);
		
		Для каждого ТекСтрока Из ТаблицаОперацийДляПечати Цикл
			ПрибытиеУбытиеОперацияСтрокаБезСтанции = Макет.ПолучитьОбласть("ПрибытиеУбытиеОперацияСтрокаБезСтанции");
			ПрибытиеУбытиеОперацияСтрокаБезСтанции.Параметры.ОперацияПрибытиеСсылка  = ТекСтрока.ОперацияПрибытиеСсылка;
			ПрибытиеУбытиеОперацияСтрокаБезСтанции.Параметры.ОперацияПрибытиеДата    = ТекСтрока.ОперацияПрибытиеДата;
			ПрибытиеУбытиеОперацияСтрокаБезСтанции.Параметры.ОперацияПрибытиеВид     = ТекСтрока.ОперацияПрибытиеВид;
			ПрибытиеУбытиеОперацияСтрокаБезСтанции.Параметры.ОперацияПрибытиеНомер   = ТекСтрока.ОперацияПрибытиеНомер;
			
			ДокументРезультат.Вывести(ПрибытиеУбытиеОперацияСтрокаБезСтанции);
		КонецЦикла;
		
		ЗаголовокПровескаБезСтанции = Макет.ПолучитьОбласть("ЗаголовокПровескаБезСтанции");
		Если ЗначениеЗаполнено(ПровескаПрибытие) Тогда
			ЗаголовокПровескаБезСтанции.Параметры.ПровескаПрибытие = ПровескаПрибытие.Номер;
			ЗаголовокПровескаБезСтанции.Параметры.ПровескаПрибытиеСсылка = ПровескаПрибытие;
		КонецЕсли;
		ДокументРезультат.Вывести(ЗаголовокПровескаБезСтанции);
		
		ПрибытиеУбытиеПровескаЗаголовокБезСтанции = Макет.ПолучитьОбласть("ПрибытиеУбытиеПровескаЗаголовокБезСтанции");
		ДокументРезультат.Вывести(ПрибытиеУбытиеПровескаЗаголовокБезСтанции);
		
		Для каждого ТекПровеска Из ТаблицаПровесокДляПечати Цикл
			
			ПрибытиеУбытиеПровескаСтрокаБезСтанции = Макет.ПолучитьОбласть("ПрибытиеУбытиеПровескаСтрокаБезСтанции");
			ПрибытиеУбытиеПровескаСтрокаБезСтанции.Параметры.КодГрузаПрибытие       = ТекПровеска.КодГрузаПрибытие;
			ПрибытиеУбытиеПровескаСтрокаБезСтанции.Параметры.ГрузПрибытие           = ТекПровеска.ГрузПрибытие;
			ПрибытиеУбытиеПровескаСтрокаБезСтанции.Параметры.БруттоПеревесПрибытие  = ТекПровеска.БруттоПрибытие;
			ПрибытиеУбытиеПровескаСтрокаБезСтанции.Параметры.ТараДокПрибытие        = ТекПровеска.ТараПрибытие;
			ПрибытиеУбытиеПровескаСтрокаБезСтанции.Параметры.НеттоРасчетноеПрибытие = ТекПровеска.НеттоРасчетноеПрибытие;
			ПрибытиеУбытиеПровескаСтрокаБезСтанции.Параметры.НеттоДокПрибытие       = ТекПровеска.НеттоПрибытие;
			
			НеттоРасчетноеПрибытие = ?(ЗначениеЗаполнено(ТекПровеска.НеттоРасчетноеПрибытие), ТекПровеска.НеттоРасчетноеПрибытие, 0);
			НеттоПрибытие          = ?(ЗначениеЗаполнено(ТекПровеска.НеттоПрибытие), ТекПровеска.НеттоПрибытие, 0);
			
			ПрибытиеУбытиеПровескаСтрокаБезСтанции.Параметры.РазницаПрибытие        = НеттоРасчетноеПрибытие - НеттоПрибытие;
			
			ДокументРезультат.Вывести(ПрибытиеУбытиеПровескаСтрокаБезСтанции);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ДокументРезультат;
	
КонецФункции

Функция СформироватьТаблицуПровесокДляПечати(ВыгрузкаПровески)
	
	ТаблицаПровесокДляПечати = Новый ТаблицаЗначений;
	ТаблицаПровесокДляПечати.Колонки.Добавить("ГрузПрибытие");
	ТаблицаПровесокДляПечати.Колонки.Добавить("КодГрузаПрибытие");
	ТаблицаПровесокДляПечати.Колонки.Добавить("БруттоПрибытие");
	ТаблицаПровесокДляПечати.Колонки.Добавить("ТараПрибытие");
	ТаблицаПровесокДляПечати.Колонки.Добавить("НеттоРасчетноеПрибытие");
	ТаблицаПровесокДляПечати.Колонки.Добавить("НеттоПрибытие");
	ТаблицаПровесокДляПечати.Колонки.Добавить("ГрузУбытие");
	ТаблицаПровесокДляПечати.Колонки.Добавить("КодГрузаУбытие");
	ТаблицаПровесокДляПечати.Колонки.Добавить("БруттоУбытие");
	ТаблицаПровесокДляПечати.Колонки.Добавить("ТараУбытие");
	ТаблицаПровесокДляПечати.Колонки.Добавить("НеттоРасчетноеУбытие");
	ТаблицаПровесокДляПечати.Колонки.Добавить("НеттоУбытие");
	ТаблицаПровесокДляПечати.Колонки.Добавить("ЗаполненоПрибытие");
	ТаблицаПровесокДляПечати.Колонки.Добавить("ЗаполненоУбытие");
	
	КоличествоПрибытий = 0;
	КоличествоУбытий   = 0;
	
	Для каждого ТекСтрока Из ВыгрузкаПровески Цикл
		
		Если ТекСтрока.Прибытие = 1 Тогда
			
			Если КоличествоПрибытий >= ТаблицаПровесокДляПечати.Количество() Тогда
				НоваяСтрока = ТаблицаПровесокДляПечати.Добавить();
				НоваяСтрока.ЗаполненоПрибытие = Истина;
				НоваяСтрока.ЗаполненоУбытие   = Ложь;
			Иначе
				НоваяСтрока = ТаблицаПровесокДляПечати[КоличествоПрибытий];
				НоваяСтрока.ЗаполненоПрибытие = Истина;
			КонецЕсли;
			НоваяСтрока.ГрузПрибытие = ТекСтрока.Груз;
			НоваяСтрока.КодГрузаПрибытие = ТекСтрока.КодГруза;
			НоваяСтрока.БруттоПрибытие = ТекСтрока.Брутто;
			НоваяСтрока.ТараПрибытие = ТекСтрока.Тара;
			НоваяСтрока.НеттоРасчетноеПрибытие = ТекСтрока.НеттоРасчетное;
			НоваяСтрока.НеттоПрибытие = ТекСтрока.Нетто;
			
			КоличествоПрибытий = КоличествоПрибытий + 1;
		Иначе
			
			Если КоличествоУбытий >= ТаблицаПровесокДляПечати.Количество() Тогда
				НоваяСтрока = ТаблицаПровесокДляПечати.Добавить();
				НоваяСтрока.ЗаполненоУбытие   = Истина;
				НоваяСтрока.ЗаполненоПрибытие = Ложь;
			Иначе
				НоваяСтрока = ТаблицаПровесокДляПечати[КоличествоУбытий];
				НоваяСтрока.ЗаполненоУбытие = Истина;
			КонецЕсли;
			НоваяСтрока.ГрузУбытие = ТекСтрока.Груз;
			НоваяСтрока.КодГрузаУбытие = ТекСтрока.КодГруза;
			НоваяСтрока.БруттоУбытие = ТекСтрока.Брутто;
			НоваяСтрока.ТараУбытие = ТекСтрока.Тара;
			НоваяСтрока.НеттоРасчетноеУбытие = ТекСтрока.НеттоРасчетное;
			НоваяСтрока.НеттоУбытие = ТекСтрока.Нетто;
			
			КоличествоУбытий = КоличествоУбытий + 1;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаПровесокДляПечати;
	
КонецФункции

Функция СформироватьТаблицуОперацийДляПечати(ВыгрузкаОпераций)
	
	ТаблицаОперацийДляПечати = Новый ТаблицаЗначений;
	ТаблицаОперацийДляПечати.Колонки.Добавить("ОперацияПрибытиеСсылка");
	ТаблицаОперацийДляПечати.Колонки.Добавить("ОперацияПрибытиеДата");
	ТаблицаОперацийДляПечати.Колонки.Добавить("ОперацияПрибытиеВид");
	ТаблицаОперацийДляПечати.Колонки.Добавить("ОперацияПрибытиеНомер");
	ТаблицаОперацийДляПечати.Колонки.Добавить("ОперацияУбытиеСсылка");
	ТаблицаОперацийДляПечати.Колонки.Добавить("ОперацияУбытиеДата");
	ТаблицаОперацийДляПечати.Колонки.Добавить("ОперацияУбытиеВид");
	ТаблицаОперацийДляПечати.Колонки.Добавить("ОперацияУбытиеНомер");
	ТаблицаОперацийДляПечати.Колонки.Добавить("ЗаполненоПрибытие");
	ТаблицаОперацийДляПечати.Колонки.Добавить("ЗаполненоУбытие");
	
	КоличествоПрибытий = 0;
	КоличествоУбытий   = 0;
	
	Для каждого ТекСтрока Из ВыгрузкаОпераций Цикл
		
		Если ТекСтрока.Прибытие = 1 Тогда
			
			Если КоличествоПрибытий >= ТаблицаОперацийДляПечати.Количество() Тогда
				НоваяСтрока = ТаблицаОперацийДляПечати.Добавить();
				НоваяСтрока.ЗаполненоПрибытие = Истина;
				НоваяСтрока.ЗаполненоУбытие   = Ложь;
			Иначе
				НоваяСтрока = ТаблицаОперацийДляПечати[КоличествоПрибытий];
				НоваяСтрока.ЗаполненоПрибытие = Истина;
			КонецЕсли;
			НоваяСтрока.ОперацияПрибытиеСсылка = ТекСтрока.Ссылка;
			НоваяСтрока.ОперацияПрибытиеДата = ТекСтрока.Дата;
			НоваяСтрока.ОперацияПрибытиеВид = ТекСтрока.Операция;
			НоваяСтрока.ОперацияПрибытиеНомер = ТекСтрока.Номер;
			
			КоличествоПрибытий = КоличествоПрибытий + 1;
		Иначе
			
			Если КоличествоУбытий >= ТаблицаОперацийДляПечати.Количество() Тогда
				НоваяСтрока = ТаблицаОперацийДляПечати.Добавить();
				НоваяСтрока.ЗаполненоУбытие   = Истина;
				НоваяСтрока.ЗаполненоПрибытие = Ложь;
			Иначе
				НоваяСтрока = ТаблицаОперацийДляПечати[КоличествоУбытий];
				НоваяСтрока.ЗаполненоУбытие = Истина;
			КонецЕсли;
			НоваяСтрока.ОперацияУбытиеСсылка = ТекСтрока.Ссылка;
			НоваяСтрока.ОперацияУбытиеДата = ТекСтрока.Дата;
			НоваяСтрока.ОперацияУбытиеВид = ТекСтрока.Операция;
			НоваяСтрока.ОперацияУбытиеНомер = ТекСтрока.Номер;
			
			КоличествоУбытий = КоличествоУбытий + 1;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаОперацийДляПечати;
	
КонецФункции

&НаСервере
Процедура ПодобратьЗаказыНаТСНаСервере(ПодборПоКоманде = Ложь)
	
	Если Не ПодборПоКоманде И ЗначениеЗаполнено(ЗаказНаТСПрибытие) И ЗначениеЗаполнено(ЗаказНаТСУбытие) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПоСтанции Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	уатОбеспечениеЗаказовНаТСВагонами.ЗаказНаТС КАК ЗаказНаТС,
		|	уатОбеспечениеЗаказовНаТСВагонами.ЗаказНаТС.ОтправлениеС КАК ЗаказНаТСОтправлениеС
		|ИЗ
		|	РегистрСведений.уатОбеспечениеЗаказовНаТСВагонами КАК уатОбеспечениеЗаказовНаТСВагонами
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ДатаНачала <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА НЕ(&ДатаНачала > уатОбеспечениеЗаказовНаТСВагонами.ЗаказНаТС.ДоставкаПо
		|							ИЛИ &ДатаОкончания < уатОбеспечениеЗаказовНаТСВагонами.ЗаказНаТС.ОтправлениеС)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И уатОбеспечениеЗаказовНаТСВагонами.Вагон = &Вагон
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказНаТСОтправлениеС УБЫВ";
		Запрос.УстановитьПараметр("ДатаНачала", ПериодДатаНач);
		Запрос.УстановитьПараметр("ДатаОкончания", ПериодДатаКон);
		Запрос.УстановитьПараметр("Вагон", Вагон);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ЗаказНаТСПрибытие = Выборка.ЗаказНаТС;
			ЗаказНаТСУбытие = Выборка.ЗаказНаТС;
		Иначе
			ЗаказНаТСПрибытие = Неопределено;
			ЗаказНаТСУбытие = Неопределено;
			
			ТекстНСтр = НСтр("ru='В указанный период не найдены Заказы на ТС обеспеченные вагоном ""%1""'");
			ТекстНСтр = СтрЗаменить(ТекстНСтр, "%1", Вагон);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСтр);
			Возврат;
		КонецЕсли;
		
	Иначе
		
		ВыборкаЗаказНаТСПрибытие = Неопределено;
		ВыборкаЗаказНаТСУбытие = Неопределено;
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	уатОбеспечениеЗаказовНаТСВагонами.ЗаказНаТС КАК ЗаказНаТС,
		|	уатОбеспечениеЗаказовНаТСВагонами.ЗаказНаТС.ОтправлениеС КАК ЗаказНаТСОтправлениеС,
		|	уатОбеспечениеЗаказовНаТСВагонами.ЗаказНаТС.АдресНазначения КАК ЗаказНаТСАдресОтправления
		|ИЗ
		|	РегистрСведений.уатОбеспечениеЗаказовНаТСВагонами КАК уатОбеспечениеЗаказовНаТСВагонами
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ДатаНачала <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА НЕ(&ДатаНачала > уатОбеспечениеЗаказовНаТСВагонами.ЗаказНаТС.ДоставкаПо
		|							ИЛИ &ДатаОкончания < уатОбеспечениеЗаказовНаТСВагонами.ЗаказНаТС.ОтправлениеС)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И уатОбеспечениеЗаказовНаТСВагонами.Вагон = &Вагон
		|	И уатОбеспечениеЗаказовНаТСВагонами.ЗаказНаТС.АдресНазначения = &Станция
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказНаТСОтправлениеС УБЫВ";
		Запрос.УстановитьПараметр("ДатаНачала", ПериодДатаНач);
		Запрос.УстановитьПараметр("ДатаОкончания", ПериодДатаКон);
		Запрос.УстановитьПараметр("Вагон", Вагон);
		Запрос.УстановитьПараметр("Станция", Станция);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ВыборкаЗаказНаТСПрибытие = Выборка.ЗаказНаТС;
		КонецЕсли;
		
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	уатОбеспечениеЗаказовНаТСВагонами.ЗаказНаТС КАК ЗаказНаТС,
		|	уатОбеспечениеЗаказовНаТСВагонами.ЗаказНаТС.ОтправлениеС КАК ЗаказНаТСОтправлениеС,
		|	уатОбеспечениеЗаказовНаТСВагонами.ЗаказНаТС.АдресОтправления КАК ЗаказНаТСАдресОтправления
		|ИЗ
		|	РегистрСведений.уатОбеспечениеЗаказовНаТСВагонами КАК уатОбеспечениеЗаказовНаТСВагонами
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ДатаНачала <> ДАТАВРЕМЯ(1, 1, 1)
		|				ТОГДА НЕ(&ДатаНачала > уатОбеспечениеЗаказовНаТСВагонами.ЗаказНаТС.ДоставкаПо
		|							ИЛИ &ДатаОкончания < уатОбеспечениеЗаказовНаТСВагонами.ЗаказНаТС.ОтправлениеС)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И уатОбеспечениеЗаказовНаТСВагонами.Вагон = &Вагон
		|	И уатОбеспечениеЗаказовНаТСВагонами.ЗаказНаТС.АдресОтправления = &Станция
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказНаТСОтправлениеС УБЫВ";
		Запрос.УстановитьПараметр("ДатаНачала", ПериодДатаНач);
		Запрос.УстановитьПараметр("ДатаОкончания", ПериодДатаКон);
		Запрос.УстановитьПараметр("Вагон", Вагон);
		Запрос.УстановитьПараметр("Станция", Станция);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ВыборкаЗаказНаТСУбытие = Выборка.ЗаказНаТС;
		КонецЕсли;
		
		Если Не (ЗначениеЗаполнено(ВыборкаЗаказНаТСПрибытие) Или ЗначениеЗаполнено(ВыборкаЗаказНаТСУбытие)) Тогда
			ТекстНСтр = НСтр("ru='В указанный период не найдены Заказы на ТС обеспеченные вагоном ""%1""'");
			Если ПоСтанции Тогда
				ТекстНСтр = ТекстНСтр + НСтр("ru=' и связанных со станцией ""%2""'");
				ТекстНСтр = СтрЗаменить(ТекстНСтр, "%2", Станция);
			КонецЕсли;
			ТекстНСтр = СтрЗаменить(ТекстНСтр, "%1", Вагон);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСтр);
			Возврат;
		КонецЕсли;
		
		ЗаказНаТСПрибытие = ?(ЗначениеЗаполнено(ВыборкаЗаказНаТСПрибытие), ВыборкаЗаказНаТСПрибытие, ВыборкаЗаказНаТСУбытие);
		ЗаказНаТСУбытие = ?(ЗначениеЗаполнено(ВыборкаЗаказНаТСУбытие), ВыборкаЗаказНаТСУбытие, ВыборкаЗаказНаТСПрибытие);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура НайтиОперацииРегистрирующиеПрибытиеУбытие(ОперацияПрибытие, ДатаПрибытия, ОперацияУбытие, ДатаУбытия, ТаблицаОпераций)
	
	Для каждого ТекОперация Из ТаблицаОпераций Цикл
		Если ТекОперация.Операция.ЭтоПрибытие Тогда
			ОперацияПрибытие = ТекОперация.Ссылка;
			ДатаПрибытия = ТекОперация.Дата;
		ИначеЕсли ТекОперация.Операция.ЭтоУбытие Тогда
			ОперацияУбытие = ТекОперация.Ссылка;
			ДатаУбытия = ТекОперация.Дата;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
